In [85]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [86]:
train_df = pd.read_csv("titanic/train.csv")
test_df = pd.read_csv("titanic/test.csv")

In [87]:
train_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [88]:
test_df.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [89]:
train_survived = train_df["Survived"]

In [90]:
traind_df = train_df.drop("Survived", axis=1)

In [91]:
traind_df.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [92]:
traind_df = traind_df.drop(["Ticket", "Name"], axis=1)
test_df = test_df.drop(["Ticket", "Name"], axis=1)

In [93]:
traind_df.head(1)

   PassengerId  Pclass   Sex   Age  SibSp  Parch  Fare Cabin Embarked
0            1       3  male  22.0      1      0  7.25   NaN        S

In [94]:
traind_df["Sex"] = traind_df["Sex"] == "male"
test_df["Sex"] = test_df["Sex"] == "male"
traind_df.head(1)

   PassengerId  Pclass   Sex   Age  SibSp  Parch  Fare Cabin Embarked
0            1       3  True  22.0      1      0  7.25   NaN        S

In [95]:
from sklearn.preprocessing import LabelEncoder

In [96]:
traind_df["Embarked"] = LabelEncoder().fit_transform(traind_df["Embarked"])
test_df["Embarked"] = LabelEncoder().fit_transform(test_df["Embarked"])
traind_df.head(1)

   PassengerId  Pclass   Sex   Age  SibSp  Parch  Fare Cabin  Embarked
0            1       3  True  22.0      1      0  7.25   NaN         2

In [97]:
traind_df["Cabin"] = traind_df["Cabin"].astype(np.str_).str[0]
test_df["Cabin"] = test_df["Cabin"].astype(np.str_).str[0]
traind_df.head(1)

   PassengerId  Pclass   Sex   Age  SibSp  Parch  Fare Cabin  Embarked
0            1       3  True  22.0      1      0  7.25     n         2

In [98]:
traind_df["Cabin"] = LabelEncoder().fit_transform(traind_df["Cabin"])
test_df["Cabin"] = LabelEncoder().fit_transform(test_df["Cabin"])
traind_df.head(1)

   PassengerId  Pclass   Sex   Age  SibSp  Parch  Fare  Cabin  Embarked
0            1       3  True  22.0      1      0  7.25      8         2

In [99]:
from sklearn.preprocessing import StandardScaler

In [100]:
traind_df.keys()

Index(['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

In [101]:
traind_df = StandardScaler().fit_transform(traind_df)
test_df = StandardScaler().fit_transform(test_df)

In [102]:
traind_df = pd.DataFrame(data=traind_df, columns=['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Cabin', 'Embarked'])
test_df = pd.DataFrame(data=test_df, columns=['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Cabin', 'Embarked'])

In [104]:
traind_df.head(2)

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,-1.730108,0.827377,0.737695,-0.530377,0.432793,-0.473674,-0.502445,0.522067,0.581114
1,-1.726220,-1.566107,-1.355574,0.571831,0.432793,-0.473674,0.786845,-1.917594,-1.938460

In [105]:
test_df.head(2)

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,-1.727912,0.873482,0.755929,0.298549,-0.499470,-0.400248,-0.497811,0.500456,-0.470915
1,-1.719625,0.873482,-1.322876,1.181328,0.616992,-0.400248,-0.512660,0.500456,0.700767